In [2]:
import pandas as pd

In [3]:
import numpy as np

In [4]:
dfa=pd.DataFrame(np.random.randint(1,20,12).reshape(3,4),index=['A','B','C'],columns=['Q1','Q2','Q3','Q4'])
dfb=pd.DataFrame(np.random.randint(1,20,12).reshape(3,4),index=['D','E','F'],columns=['Q1','Q2','Q3','Q4'])

In [5]:
dfa

   Q1  Q2  Q3  Q4
A   1   4   5   1
B  15   4   1   8
C   5  13   7   2

In [6]:
dfb

   Q1  Q2  Q3  Q4
D  15  10   4  14
E   6  10  16  12
F   2  10  17  15

In [7]:
pd.concat([dfa,dfb])

   Q1  Q2  Q3  Q4
A   1   4   5   1
B  15   4   1   8
C   5  13   7   2
D  15  10   4  14
E   6  10  16  12
F   2  10  17  15

In [8]:
pd.concat([dfa,dfb],axis=1)

     Q1    Q2   Q3   Q4    Q1    Q2    Q3    Q4
A   1.0   4.0  5.0  1.0   NaN   NaN   NaN   NaN
B  15.0   4.0  1.0  8.0   NaN   NaN   NaN   NaN
C   5.0  13.0  7.0  2.0   NaN   NaN   NaN   NaN
D   NaN   NaN  NaN  NaN  15.0  10.0   4.0  14.0
E   NaN   NaN  NaN  NaN   6.0  10.0  16.0  12.0
F   NaN   NaN  NaN  NaN   2.0  10.0  17.0  15.0

In [9]:
df3=pd.DataFrame({'Name':['BK','SS','AK','KV','MM'],'DBP':[80,77,70,80,72],'SBP':[110,100,120,125,112]})

In [10]:
df3

  Name  DBP  SBP
0   BK   80  110
1   SS   77  100
2   AK   70  120
3   KV   80  125
4   MM   72  112

In [11]:
df3['DBP'].unique()

array([80, 77, 70, 72], dtype=int64)

In [12]:
df3['DBP'].nunique()

4

In [13]:
df3['DBP'].value_counts()

80    2
72    1
77    1
70    1
Name: DBP, dtype: int64

In [14]:
def add2(x):
    return x+2

In [15]:
df3['DBP']=df3['DBP'].apply(add2)

In [16]:
df3['DBP']

0    82
1    79
2    72
3    82
4    74
Name: DBP, dtype: int64

In [17]:
df3['DBP'].apply(lambda x:x+2)

0    84
1    81
2    74
3    84
4    76
Name: DBP, dtype: int64

In [18]:
df3

  Name  DBP  SBP
0   BK   82  110
1   SS   79  100
2   AK   72  120
3   KV   82  125
4   MM   74  112

In [19]:
df3.index

RangeIndex(start=0, stop=5, step=1)

In [20]:
df3.columns

Index(['Name', 'DBP', 'SBP'], dtype='object')

In [21]:
df3.sort_values('DBP')

  Name  DBP  SBP
2   AK   72  120
4   MM   74  112
1   SS   79  100
0   BK   82  110
3   KV   82  125

In [22]:
df3.isnull().count()

Name    5
DBP     5
SBP     5
dtype: int64

In [23]:
df=pd.read_csv('data1.txt',header = None)

In [24]:
df

          0         1
0    6.1101  17.59200
1    5.5277   9.13020
2    8.5186  13.66200
3    7.0032  11.85400
4    5.8598   6.82330
..      ...       ...
92   5.8707   7.20290
93   5.3054   1.98690
94   8.2934   0.14454
95  13.3940   9.05510
96   5.4369   0.61705

[97 rows x 2 columns]

In [25]:
type(df)

pandas.core.frame.DataFrame

In [26]:
df.to_csv('data2.txt',header=None,index=None)

In [27]:
df2=pd.read_csv('data2.txt',header=None)

In [28]:
df2

          0         1
0    6.1101  17.59200
1    5.5277   9.13020
2    8.5186  13.66200
3    7.0032  11.85400
4    5.8598   6.82330
..      ...       ...
92   5.8707   7.20290
93   5.3054   1.98690
94   8.2934   0.14454
95  13.3940   9.05510
96   5.4369   0.61705

[97 rows x 2 columns]